OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f87j90.h
extern __at(0x0F66) __sfr CCPR2;
extern __at(0x0F66) __sfr CCPR2L;
extern __at(0x0F67) __sfr CCPR2H;

//==============================================================================
//        CCP1CON Bits

extern __at(0x0F68) __sfr CCP1CON;

typedef union
  {
  struct
    {
    unsigned CCP1M0             : 1;
    unsigned CCP1M1             : 1;
    unsigned CCP1M2             : 1;
    unsigned CCP1M3             : 1;
    unsigned DC1B0              : 1;
    unsigned DC1B1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DCCP1Y             : 1;
    unsigned DCCP1X             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP1M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC1B               : 2;
    unsigned                    : 2;
    };
  } __CCP1CONbits_t;

extern __at(0x0F68) volatile __CCP1CONbits_t CCP1CONbits;

#define _CCP1M0                 0x01
#define _CCP1M1                 0x02
#define _CCP1M2                 0x04
#define _CCP1M3                 0x08
#define _DC1B0                  0x10
#define _DCCP1Y                 0x10
#define _DC1B1                  0x20
#define _DCCP1X                 0x20

//==============================================================================


//==============================================================================
//        ECCP1CON Bits

extern __at(0x0F68) __sfr ECCP1CON;

typedef union
  {
  struct
    {
    unsigned CCP1M0             : 1;
    unsigned CCP1M1             : 1;
    unsigned CCP1M2             : 1;
    unsigned CCP1M3             : 1;
    unsigned DC1B0              : 1;
    unsigned DC1B1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DCCP1Y             : 1;
    unsigned DCCP1X             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP1M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC1B               : 2;
    unsigned                    : 2;
    };
  } __ECCP1CONbits_t;

extern __at(0x0F68) volatile __ECCP1CONbits_t ECCP1CONbits;

#define _ECCP1CON_CCP1M0        0x01
#define _ECCP1CON_CCP1M1        0x02
#define _ECCP1CON_CCP1M2        0x04
#define _ECCP1CON_CCP1M3        0x08
#define _ECCP1CON_DC1B0         0x10
#define _ECCP1CON_DCCP1Y        0x10
#define _ECCP1CON_DC1B1         0x20
#define _ECCP1CON_DCCP1X        0x20

//==============================================================================

extern __at(0x0F69) __sfr CCPR1;
extern __at(0x0F69) __sfr CCPR1L;
extern __at(0x0F6A) __sfr CCPR1H;

//==============================================================================
//        LCDDATA5 Bits

extern __at(0x0F6B) __sfr LCDDATA5;

typedef union
  {
  struct
    {
    unsigned S40C0              : 1;
    unsigned S41C0              : 1;
    unsigned S42C0              : 1;
    unsigned S43C0              : 1;
    unsigned S44C0              : 1;
    unsigned S45C0              : 1;
    unsigned S46C0              : 1;
    unsigned S47C0              : 1;
    };

  struct
    {
    unsigned SEG40COM0          : 1;
    unsigned SEG41COM0          : 1;
    unsigned SEG42COM0          : 1;
    unsigned SEG43COM0          : 1;
    unsigned SEG44COM0          : 1;
    unsigned SEG45COM0          : 1;
    unsigned SEG46COM0          : 1;
    unsigned SEG47COM0          : 1;
    };
  } __LCDDATA5bits_t;

extern __at(0x0F6B) volatile __LCDDATA5bits_t LCDDATA5bits;

#define _S40C0                  0x01
#define _SEG40COM0              0x01
#define _S41C0                  0x02
#define _SEG41COM0              0x02
#define _S42C0                  0x04
#define _SEG42COM0              0x04
#define _S43C0                  0x08
#define _SEG43COM0              0x08
#define _S44C0                  0x10
#define _SEG44COM0              0x10
#define _S45C0                  0x20
#define _SEG45COM0              0x20
#define _S46C0                  0x40
#define _SEG46COM0              0x40
#define _S47C0                  0x80
#define _SEG47COM0              0x80

//==============================================================================


//==============================================================================
//        LCDDATA6 Bits

extern __at(0x0F6C) __sfr LCDDATA6;

typedef union
  {
  struct
    {
    unsigned S00C1              : 1;
    unsigned S01C1              : 1;
    unsigned S02C1              : 1;
    unsigned S03C1              : 1;
    unsigned S04C1              : 1;
    unsigned S05C1              : 1;
    unsigned S06C1              : 1;
    unsigned S07C1              : 1;
    };

  struct
    {
    unsigned SEG0COM1           : 1;
    unsigned SEG1COM1           : 1;
    unsigned SEG2COM1           : 1;
    unsigned SEG3COM1           : 1;
    unsigned SEG4COM1           : 1;
    unsigned SEG5COM1           : 1;
    unsigned SEG6COM1           : 1;
    unsigned SEG7COM1           : 1;
    };

  struct
    {
    unsigned S0C1               : 1;
    unsigned S1C1               : 1;
    unsigned S2C1               : 1;
    unsigned S3C1               : 1;
    unsigned S4C1               : 1;
    unsigned S5C1               : 1;
    unsigned S6C1               : 1;
    unsigned S7C1               : 1;
    };
  } __LCDDATA6bits_t;

extern __at(0x0F6C) volatile __LCDDATA6bits_t LCDDATA6bits;

#define _S00C1                  0x01
#define _SEG0COM1               0x01
#define _S0C1                   0x01
#define _S01C1                  0x02
#define _SEG1COM1               0x02
#define _S1C1                   0x02
#define _S02C1                  0x04
#define _SEG2COM1               0x04
#define _S2C1                   0x04
#define _S03C1                  0x08
#define _SEG3COM1               0x08
#define _S3C1                   0x08
#define _S04C1                  0x10
#define _SEG4COM1               0x10
#define _S4C1                   0x10
#define _S05C1                  0x20
#define _SEG5COM1               0x20
#define _S5C1                   0x20
#define _S06C1                  0x40
#define _SEG6COM1               0x40
#define _S6C1                   0x40
#define _S07C1                  0x80
#define _SEG7COM1               0x80
#define _S7C1                   0x80

//==============================================================================


//==============================================================================
//        LCDDATA7 Bits

